In [1]:
import pandas as pd

In [2]:
s=pd.Series([1,2,3,4])
type(s)

pandas.core.series.Series

In [6]:
s1=pd.Series([1,2,3,4],index=['A','B','C','D'])
s1

A    1
B    2
C    3
D    4
dtype: int64

In [14]:
data=[[1,444,'abc'],
      [2,555,'def'],
      [3,666,'ghi'],
      [4,777,'xyz']
]
df=pd.DataFrame(data,columns=['ID','std_id','Dept'])
df
df['Dept']=df['Dept'].astype('category')
df.dtypes

ID           int64
std_id       int64
Dept      category
dtype: object

In [16]:
df.describe(include='category')

       Dept
count     4
unique    4
top     abc
freq      1

In [25]:
data2={'ID':[1,2,3,4],
       'std_id':[444,555,666,777],
       'Dept':['abc','def','ghi','xyz']
       }
df=pd.DataFrame(data2)
df.columns

Index(['ID', 'std_id', 'Dept'], dtype='object')

In [27]:
df['Dept']=df['Dept'].astype('category')

In [28]:
df.dtypes

ID           int64
std_id       int64
Dept      category
dtype: object

In [30]:
df.describe()

             ID      std_id
count  4.000000    4.000000
mean   2.500000  610.500000
std    1.290994  143.300384
min    1.000000  444.000000
25%    1.750000  527.250000
50%    2.500000  610.500000
75%    3.250000  693.750000
max    4.000000  777.000000

In [31]:
x=df['std_id'].unique().sum()
x

np.int64(2442)

In [21]:
df['std_id'].min()

np.int64(444)

In [23]:
df.std_id.idxmax()

3

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ID      4 non-null      int64
 1   std_id  4 non-null      int64
 2   Dept    4 non-null      category
dtypes: category(1), int64(2)
memory usage: 404.0 bytes

In [32]:
df['ID'].sum()

np.int64(10)

In [33]:
def duplicate(x):
     return x*2
df['std_id'].apply(duplicate)

0     888
1    1110
2    1332
3    1554
Name: std_id, dtype: int64

In [34]:
df['std_id'].apply(lambda x:x*2)

0     888
1    1110
2    1332
3    1554
Name: std_id, dtype: int64

In [35]:
df['std_id'].iloc[1]

np.int64(555)

In [36]:
df.iloc[2,1]

np.int64(666)

In [40]:
num_col=df.iloc[:,0:2]
cat_loc=df.iloc[:,2:3]
cat_loc

  Dept
0  abc
1  def
2  ghi
3  xyz

In [41]:
df['new_col']=df['std_id']+df['ID']
df

   ID  std_id Dept  new_col
0   1     444  abc      445
1   2     555  def      557
2   3     666  ghi      669
3   4     777  xyz      781

In [42]:
df.drop('new_col',axis=1)

   ID  std_id Dept
0   1     444  abc
1   2     555  def
2   3     666  ghi
3   4     777  xyz

In [44]:
def isNull(df):
     null=df.isnull().sum()

     return pd.DataFrame(null).T

In [43]:
null=df.isnull().sum()
pd.DataFrame(null).T

   ID  std_id  Dept  new_col
0   0       0     0        0

In [45]:
from isnull import isNull
isNull(df)

ModuleNotFoundError: No module named 'isnull'